## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`


**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 5 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.get_metrics_token_secret_value_ecs_task will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "get_metrics_token_secret_value_ecs_task"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-metrics-token-WfVmHL",
            ]
        }
    }

  # aws_iam_policy.get_metrics_token_secret_value_ecs_task will be created
  + resource "aws_iam_policy" "get_metrics_token_secret_value_ecs_task" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "GetMetricstokenSecretValuePolicies"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.secretsmanager_role will be created
  + resource "aws_iam_role" "secretsmanager_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "metrics_secretsmanager_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.server_metrics_task_execution_role will be created
  + resource "aws_iam_role" "server_metrics_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "server_metrics_task_execution_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.secretsmanager_etl_policies will be created
  + resource "aws_iam_role_policy_attachment" "secretsmanager_etl_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "server_metrics_task_execution_role"
    }

  # aws_secretsmanager_secret.metrics_token will be updated in-place
  ~ resource "aws_secretsmanager_secret" "metrics_token" {
        id                      = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-metrics-token-WfVmHL"
        name                    = "server-metrics-token"
      + recovery_window_in_days = 30
        tags                    = {}
        # (3 unchanged attributes hidden)
    }

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_appstore_metrics_event_rule-terraform-20210702182404676800000002"
      - input          = jsonencode({}) -> null
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_server_metrics:1" -> (known after apply)
      ~ id                       = "masked_server_metrics" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
      ~ task_role_arn            = "arn:aws:iam::005133826942:role/server_appstore_metrics_task_execution_role" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>